;***************************************************************
;	AKI-80ゴールドボード単体
;***************************************************************

;*******************************
;	定数定義
;*******************************
RAM_B	EQU	8000H

;***************************************************************
;	メインルーチン
;***************************************************************
	ORG	RAM_B

START:
	LD	HL, 0000H
	LD	A, (PARAM1)
	LD	D, 00H
	LD	E, A
	LD	A, (PARAM2)
	LD	B, 8
LOOP:
	RRCA			; 右ローテート [A7←A0, CY←A0]
	JR	NC, NEXT
	ADD	HL, DE
NEXT:
	SLA	E		; 左シフト(レジスター) [r0←0, CY←r7]
	RL	D		; 左ローテート(レジスター) [r0←CY, CY←r7]
	DJNZ	LOOP
	LD	(RESLT1), HL
	NOP
	JR	START

;*******************************
;	ROM領域
;*******************************
	ORG	RAM_B + 40H

PARAM1:	DEFB	0AAH
PARAM2:	DEFB	55H

;*******************************
;	RAM領域
;*******************************
	ORG	RAM_B + 80H

RESLT1:	DEFS	2

	END
